snlkuharlocal/src/BusinessProcesses/РасформированиеНакладной/РасформированиеНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>РасформированиеНакладной</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <task>Task.ЗадачиПользователя</task>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтарта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершенПринудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСогласования</name>
    <comment>Объект согласования</comment>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСогласования</name>
    <comment>Состояние согласования</comment>
    <type>
      <types>EnumRef.СостояниеОбъектаСогласования</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

snlkuharlocal/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостояниеОбъектаСогласования/СостояниеОбъектаСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОбъектаСогласования</name>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/BusinessProcesses/РасформированиеНакладной/ObjectModule.bsl
Процедура СогласованоЦОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьЦО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Результат = ВыборкаДетальныеЗаписи.Согласовано;
	Если Результат Тогда
	   СформироватьУведомление("Уведомление о утверждении расформирования РНК в ЦО");
	Иначе	
		СформироватьУведомление("Уведомление о отклонении расформирования РНК");
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена;
		РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);

	КонецЕсли;
	
КонецПроцедуры

Процедура СогласоватьЦОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	СформироватьУведомление("Уведомление о расформировании РНК");

КонецПроцедуры

Процедура СогласоватьСКПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура СогласоватьОВЛПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура ИнформироватьИнициатораСогласованоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура ИнформироватьИнициатораНеСогласованоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Функция СоздатьЗадачу(Знач ТочкаМаршрутаБизнесПроцесса)
	
	Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	
	Задача.Дата                          = ТекущаяДата();
	Задача.Инициатор                     = Инициатор;
	Задача.Наименование                  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи;
	Задача.Объект                      	 = ОбъектСогласования;
	Если ТочкаМаршрутаБизнесПроцесса.РольИсполнителя.Пустая() Тогда
		Задача.Исполнитель = ЭтотОбъект.Инициатор;
	Иначе
		Задача.РольИсполнителя           = ТочкаМаршрутаБизнесПроцесса.РольИсполнителя;
	КонецЕсли;
	Задача.БизнесПроцесс                 = Ссылка;
	Задача.ТочкаМаршрута                 = ТочкаМаршрутаБизнесПроцесса;
	
	Возврат Задача;
	
КонецФункции

Процедура ОбработатьРезультатыОбработка(ТочкаМаршрутаБизнесПроцесса)
	Если ПараметрыСеанса.ЭтотУзел.Код = "OD7" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ,
		|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Накладная = &Накладная
		|	";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЗаданияНабора=Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЗаданияНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПланНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланНабора КАК ПланНабора
		|ГДЕ
		|	ПланНабора.Накладная = &Накладная";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// Не определено
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПланНабора = Выборка.Ссылка;
		
		//тзПланНабора.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПланНаборатБрэндов.НомерСтроки КАК НомерСтроки,
		|	ПланНаборатБрэндов.Состояние КАК Состояние
		|ИЗ
		|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
		|ГДЕ
		|	ПланНаборатБрэндов.Ссылка.Накладная = &Накладная";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзПланНабора = Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзПланНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЛистЗагрузкиЗаявка.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЛистЗагрузкиЗаявка.Ссылка КАК ЛистЗагрузки,
		|	ЛистЗагрузкиЗаявка.НомерСтроки КАК НомерСтроки,
		|	ЛистЗагрузкиЗаявка.НомерНакладной КАК НомерНакладной,
		|	ЛистЗагрузкиЗаявка.ДатаНакладной КАК ДатаНакладной,
		|	ЛистЗагрузкиЗаявка.Получатель КАК Получатель,
		|	ЛистЗагрузкиЗаявка.ПунктДоставки КАК ПунктДоставки,
		|	ЛистЗагрузкиЗаявка.КоличествоКоробок КАК КоличествоКоробок,
		|	ЛистЗагрузкиЗаявка.ВидНакладной КАК ВидНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
		|		ПО РасходнаяНакладная.Номер = ЛистЗагрузкиЗаявка.НомерНакладной
		|			И (НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ГОД) = НАЧАЛОПЕРИОДА(ЛистЗагрузкиЗаявка.ДатаНакладной, ГОД))
		|ГДЕ
		|	ЛистЗагрузкиЗаявка.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЛистЗагрузкиЗаявка = Результат.Выгрузить();
		////ЭлементыФормы.тзЛистЗагрузкиЗаявка.СоздатьКолонки();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЛистЗагрузкиЗаявка.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЛистЗагрузкиЛистыНабора.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЛистЗагрузкиЛистыНабора.Ссылка КАК ЛистЗагрузки,
		|	ЛистЗагрузкиЛистыНабора.Ссылка.СостояниеНакладной КАК Состояние,
		|	ЛистЗагрузкиЛистыНабора.НомерСтроки КАК НомерСтроки,
		|	ЛистЗагрузкиЛистыНабора.НомерНакладной КАК НомерНакладной,
		|	ЛистЗагрузкиЛистыНабора.ДатаНакладной КАК ДатаНакладной,
		|	ЛистЗагрузкиЛистыНабора.ШККоробки КАК ШККоробки,
		|	ЛистЗагрузкиЛистыНабора.НомерКоробки КАК НомерКоробки,
		|	ЛистЗагрузкиЛистыНабора.ВидНакладной КАК ВидНакладной,
		|	ЛистЗагрузкиЛистыНабора.ВремяСканирования КАК ВремяСканирования,
		|	ЛистЗагрузкиЛистыНабора.Получатель КАК Получатель,
		|	ЛистЗагрузкиЛистыНабора.ПунктДоставки КАК ПунктДоставки,
		|	ЛистЗагрузкиЛистыНабора.Паллета КАК Паллета,
		|	ЛистЗагрузкиЛистыНабора.ШКПаллеты КАК ШКПаллеты
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистЗагрузки.ЛистыНабора КАК ЛистЗагрузкиЛистыНабора
		|		ПО РасходнаяНакладная.Номер = ЛистЗагрузкиЛистыНабора.НомерНакладной
		|			И (НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаОтгрузки, ДЕНЬ) = НАЧАЛОПЕРИОДА(ЛистЗагрузкиЛистыНабора.Ссылка.ДатаОтгрузки, ДЕНЬ))
		|ГДЕ
		|	ЛистЗагрузкиЛистыНабора.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		
		тзЛистЗагрузкиЛистыНабора = Результат.Выгрузить();
		//ЭлементыФормы.тзЛистЗагрузкиЛистыНабора.СоздатьКолонки();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЛистЗагрузкиЛистыНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЗаявкаНаОтгрузкуСтроки.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка КАК ЗаявкаНаОтгрузку,
		|	ЗаявкаНаОтгрузкуНакладные.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаОтгрузкуНакладные.ДатаНакладной КАК ДатаНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.ВидНакладной КАК ВидНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.СостояниеНакладной КАК СостояниеНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.Доставлена КАК Доставлена,
		|	ЗаявкаНаОтгрузкуНакладные.НеОтгружать КАК НеОтгружать,
		|	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
		|	ЗаявкаНаОтгрузкуНакладные.ТипДоставки КАК ТипДоставки
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
		|		ПО РасходнаяНакладная.Ссылка = ЗаявкаНаОтгрузкуНакладные.Накладная
		|ГДЕ
		|	ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЗаявкаНаОтгрузкуСтроки = Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЗаявкаНаОтгрузкуСтроки.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		НачатьТранзакцию();
		Для каждого Строка Из тзЗаданияНабора Цикл
			ЗНБОбъект = Строка.ЗНБ.ПолучитьОбъект();
			ЗНБОбъект.Заблокировать();
			ЗНБОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отменена;
			
			// Кухарь А.Ю.  13.09.2022 начало
			// ЗНБОбъект.Записать();
			ЗНБОбъект.Записать(РежимЗаписиДокумента.Проведение);		 
			// Кухарь А.Ю.  13.09.2022 конец
			
		КонецЦикла;
		
		Попытка
			ПланНабораОбъект = ПланНабора.ПолучитьОбъект();
			ПланНабораОбъект.Заблокировать();
			Для каждого Строка Из ПланНабораОбъект.тБрэндов Цикл
				Строка.Состояние = Перечисления.СостоянияНакладной.Отменена; 
			КонецЦикла;
			ПланНабораОбъект.Записать();
		Исключение
		КонецПопытки;
	
		УникальныеЗаявки = тзЛистЗагрузкиЗаявка.Скопировать(,"ЛистЗагрузки");
		УникальныеЗаявки.Свернуть("ЛистЗагрузки");
		Для каждого Заявка Из УникальныеЗаявки Цикл
			ЛистЗагрузкиОбъект = Заявка.ЛистЗагрузки.ПолучитьОбъект();
			ЛистЗагрузкиОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЛистЗагрузки",Заявка.ЛистЗагрузки);
			МассивУдаляемыхСтрок = Новый Массив;
			МассивСтрок = тзЛистЗагрузкиЗаявка.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивУдаляемыхСтрок.Добавить(ЛистЗагрузкиОбъект.Заявка.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
				ЛистЗагрузкиОбъект.Заявка.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			ЛистЗагрузкиОбъект.Записать();
		КонецЦикла;
		
		УникальныеЗаявки = тзЛистЗагрузкиЛистыНабора.Скопировать(,"ЛистЗагрузки");
		УникальныеЗаявки.Свернуть("ЛистЗагрузки");
		Для каждого Заявка Из УникальныеЗаявки Цикл
			ЛистЗагрузкиОбъект = Заявка.ЛистЗагрузки.ПолучитьОбъект();
			ЛистЗагрузкиОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЛистЗагрузки",Заявка.ЛистЗагрузки);
			МассивУдаляемыхСтрок = Новый Массив;
			МассивСтрок = тзЛистЗагрузкиЛистыНабора.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивУдаляемыхСтрок.Добавить(ЛистЗагрузкиОбъект.ЛистыНабора.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
				ЛистЗагрузкиОбъект.ЛистыНабора.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			ЛистЗагрузкиОбъект.Записать();
		КонецЦикла;
		
		УникальныеЛистыЗагрузки = тзЗаявкаНаОтгрузкуСтроки.Скопировать(,"ЗаявкаНаОтгрузку");
		УникальныеЛистыЗагрузки.Свернуть("ЗаявкаНаОтгрузку");
		Для каждого ЗаявкаНаОтгрузку Из УникальныеЛистыЗагрузки Цикл
			ЗаявкаНаОтгрузкуОбъект = ЗаявкаНаОтгрузку.ЗаявкаНаОтгрузку.ПолучитьОбъект();
			ЗаявкаНаОтгрузкуОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЗаявкаНаОтгрузку",ЗаявкаНаОтгрузку.ЗаявкаНаОтгрузку);
			МассивИзменяемыхСтрок = Новый Массив;
			МассивСтрок = тзЗаявкаНаОтгрузкуСтроки.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивИзменяемыхСтрок.Добавить(ЗаявкаНаОтгрузкуОбъект.Накладные.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого ИзменяемаяСтрока Из МассивИзменяемыхСтрок Цикл
				ИзменяемаяСтрока.НеОтгружать = Истина;
			КонецЦикла;
			ЗаявкаНаОтгрузкуОбъект.Записать();
		КонецЦикла;
		
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отменена;
		РНКОбъект.Отгружен = Перечисления.Отгружен.Отменен;
		РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		Дата= ТекущаяДата();
		ОбъектСогласования = ДанныеЗаполнения.Ссылка;     
		Инициатор = ПараметрыСеанса.Пользователь;
		СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НаСогласовании;
		ДатаСтарта = Дата;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаявкаСогласованаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ЭтотОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован;
	ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
	РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
	РНКОбъект.Отгружен = Перечисления.Отгружен.Отменен;
	//РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Принята;
	РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отработана;
	РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ЗаявкаНеСогласованаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ЭтотОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НеСогласован;
	ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
КонецПроцедуры

Процедура РасформированиеСогласованоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано,
	|	ЗадачиПользователя.Ссылка КАК Ссылка,
	|	ЗадачиПользователя.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЗадачиПользователя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачиПользователя.Выполнена КАК Выполнена
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьОВЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ОВЛСогласовано = ВыборкаДетальныеЗаписи.Согласовано;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано,
	|	ЗадачиПользователя.Ссылка КАК Ссылка,
	|	ЗадачиПользователя.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЗадачиПользователя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачиПользователя.Выполнена КАК Выполнена
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьСК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СКСогласовано = ВыборкаДетальныеЗаписи.Согласовано;
	Результат = ОВЛСогласовано И СКСогласовано;
	БизнесПроцессОбъект = ВыборкаДетальныеЗаписи.БизнесПроцесс.ПолучитьОбъект();
	Если Результат Тогда
		БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован;
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		//РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Утверждена;
		//РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Принята;
		РНКОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
	Иначе
		БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НеСогласован;
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена;
		//РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РНКОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	БизнесПроцессОбъект.Записать();
	Если БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован Тогда
		СформироватьУведомление("Уведомление о утверждении расформирования РНК");
	Иначе	
		СформироватьУведомление("Уведомление о отклонении расформирования РНК");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

//Кухарь 10.01.19 начало
//Создание записей в РС ПисьмаНаОтправку
Процедура СформироватьУведомление(ВидУведомления) экспорт
	
	СписокПолучателей=новый СписокЗначений;
	ТемаПисьма=ВидУведомления;
	
	ТекстПисьма="";
	Если ВидУведомления="Уведомление о расформировании РНК" Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ИсполнителиЗадач.Исполнитель.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ИсполнительФизЛицоЕМэйл
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_ЦО)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Найти(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл,"@")>0 тогда
				СписокПолучателей.Добавить(СокрЛП(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл));
			КонецЕсли;
		КонецЦикла;
		
		ТекстПисьма="Утверждение расформирования "+ЭтотОбъект.ОбъектСогласования+" было инициировано пользователем "+ЭтотОбъект.Инициатор;
		
		
	ИначеЕсли ВидУведомления="Уведомление о утверждении расформирования РНК в ЦО"  тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ИсполнителиЗадач.Исполнитель.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ИсполнительФизЛицоЕМэйл
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	(ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_СК)
		|			ИЛИ ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_ОВЛ))";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Найти(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл,"@")>0 тогда
				СписокПолучателей.Добавить(СокрЛП(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл));
			КонецЕсли;
		КонецЦикла;
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было инициировано пользователем "+ЭтотОбъект.Инициатор;
		
	ИначеЕсли ВидУведомления="Уведомление о утверждении расформирования РНК"  тогда
		
		СписокПолучателей.Добавить(СокрЛП(ЭтотОбъект.Инициатор.ФизЛицо.ЕМэйл));
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было утверждено.";
		
	ИначеЕсли ВидУведомления="Уведомление о отклонении расформирования РНК"  тогда
		
		СписокПолучателей.Добавить(СокрЛП(ЭтотОбъект.Инициатор.ФизЛицо.ЕМэйл));
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было отклонено.";
		
	КонецЕсли;
	
	
	Если СокрЛП(ТекстПисьма="") Тогда
		ЗаписатьВЛог("Регламент","Пустой текст при формировании письма к коррекции № "+Номер,"Ошибка");		
	ИначеЕсли СписокПолучателей.Количество()=0 Тогда
		ЗаписатьВЛог("Регламент","Пустой список адресатов при формировании письма к коррекции № "+Номер,"Ошибка");
	Иначе
		ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма)
	СписокАдресов="";
	для каждого Стр из СписокПолучателей цикл
		если Найти(СписокАдресов,Стр.Значение)=0 тогда
			СписокАдресов=СписокАдресов+Стр.Значение+"##";
		КонецЕсли;
	КонецЦикла;
	
	СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	
	
	ЗаписьВРег=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	ЗаписьВРег.Основание=Ссылка;	
	ЗаписьВРег.ДатаСозданияПисьма=ТекущаяДата();
	ЗаписьВРег.период=ЗаписьВРег.ДатаСозданияПисьма;
	
	ЗаписьВРег.ТекстПисьма=ТекстПисьма;
	ЗаписьВРег.ТемаПисьма=ТемаПисьма;
	ЗаписьВРег.СписокПолучателей=СписокАдресов;
	ЗаписьВРег.Записать();	
КонецПроцедуры
//Кухарь 10.01.19 конец
